In [1]:
!pip install psycopg2-binary
%matplotlib notebook

Requirement already satisfied: psycopg2-binary in /opt/anaconda3/envs/PythonData/lib/python3.6/site-packages (2.9.2)

In [2]:
# Import dependencies
from sqlalchemy import create_engine
import pandas as pd 
import matplotlib.pyplot as plt
import psycopg2
import numpy as np

In [3]:
# Create engine to talk to database
engine = create_engine('postgresql://postgres:postgres@localhost:5432/employee_queries')
conn = engine.connect()

In [4]:
# Query the salary record in the database
salary_data = pd.read_sql("SELECT * FROM salaries", conn)

In [5]:
# Preview the data
salary_data.head()

   emp_no  salary
0   10001   60117
1   10002   65828
2   10003   40006
3   10004   40054
4   10005   78228

In [ ]:
# Plot Histogram
plt.figure(figsize=(0,5))
# Set axis and tick location
x_axis = salary_data["emp_no"]
ticks_location = np.arange(len(salary_data))
y_axis = salary_data["salary"]

# Create bar chart
plt.bar(x_axis, y_axis, align="center", alpha=0, color='r')

plt.xticks(ticks_location, x_axis, rotation="vertical")

plt.show()

In [11]:
# Query the title and employee record in the database
title_data = pd.read_sql("SELECT * FROM titles", conn)
employee_data = pd.read_sql("SELECT * FROM employees", conn)

In [10]:
# Display title data
title_data.head()

  title_id               title
0    s0001               Staff
1    s0002        Senior Staff
2    e0001  Assistant Engineer
3    e0002            Engineer
4    e0003     Senior Engineer

In [20]:
# Rename column to merge 
employee_df = employee_data.rename({'emp_title_id':'title_id'}, axis='columns')

employee_df.head()

        emp_no title_id  birth_date   first_name  last_name sex   hire_date
0       473302    s0001  1953-07-25     Hideyuki   Zallocco   M  1990-04-28
1       475053    e0002  1954-11-18        Byong  Delgrande   F  1991-09-07
2        57444    e0002  1958-01-30        Berry       Babb   F  1992-03-21
3       421786    s0001  1957-09-28        Xiong   Verhoeff   M  1987-11-26
4       282238    e0003  1952-10-28   Abdelkader    Baumann   F  1991-01-18
...        ...      ...         ...          ...        ...  ..         ...
300019  464231    s0001  1958-08-14  Constantino    Eastman   M  1988-10-28
300020  255832    e0002  1955-05-08       Yuping     Dayang   F  1995-02-26
300021   76671    s0001  1959-06-09       Ortrud   Plessier   M  1988-02-24
300022  264920    s0001  1959-09-22        Percy   Samarati   F  1994-09-08
300023  464503    s0002  1964-05-31       Arvind  Slobodova   M  1987-11-23

[300024 rows x 7 columns]

In [33]:
# Merge employees and title 
merge_1 = pd.merge(title_data, employee_df, on='title_id')

  title_id  title  emp_no  birth_date  first_name   last_name sex   hire_date
0    s0001  Staff  473302  1953-07-25    Hideyuki    Zallocco   M  1990-04-28
1    s0001  Staff  421786  1957-09-28       Xiong    Verhoeff   M  1987-11-26
2    s0001  Staff  273487  1957-04-14   Christoph     Parfitt   M  1991-06-28
3    s0001  Staff  246449  1958-03-23       Subbu  Bultermann   F  1988-03-25
4    s0001  Staff   48085  1964-01-19  Venkatesan        Gilg   M  1993-06-28

In [42]:
# Final and clean merge

final_merge = pd.merge(merge_1, salary_data, on='emp_no')

Clean_df = final_merge.drop(columns=['title_id', 'emp_no', 'first_name', 'last_name', 'sex', 'hire_date', 'birth_date'])

Clean_df.head()

   title  salary
0  Staff   40000
1  Staff   40000
2  Staff   56087
3  Staff   87084
4  Staff   63016

In [51]:
# Group df

salary_by_title_df = Clean_df.groupby(['title']).mean()

salary_by_title_df['salary'] = salary_by_title_df['salary'].map('${:,.2f}'.format)

salary_by_title_df.head()

                        salary
title
Assistant Engineer  $48,564.43
Engineer            $48,535.34
Manager             $51,531.04
Senior Engineer     $48,506.80
Senior Staff        $58,550.17

In [ ]:
# Bar Chart